<a href="https://colab.research.google.com/github/PabloCaSan/Data-Science-Training/blob/main/Notebook2-EntendiendoLosDataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importamos las librerías, para actualizarlas hay que usar la línea comentada (#)

In [ ]:
#!pip install --upgrade pandas
import pandas as pd
import numpy as np
pd.__version__

'1.1.5'

Se pueden crear "dataframes" (son como tablas) usando diccionarios. Primero creamos el diccionario

In [ ]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

Ahora lo convertimos en dataframe usando Pandas

In [ ]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

También se pueden redefinir los índices

In [ ]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

Podemos explorar el dataframe

In [ ]:
df.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [ ]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [ ]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

Se pueden filtrar las columnas que se muestran

In [ ]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [ ]:
df[['pais','genero']]

         pais genero
ana        co      M
benito     mx      F
camilo     co      F
daniel     mx      M
erika      mx      M
fabian     ch      M
gabriela   ch      F

También se pueden filtrar renglones

In [ ]:
df.loc['ana']

edad       10
cm        115
pais       co
genero      M
Q1          5
Q2          7
Name: ana, dtype: object

In [ ]:
df.loc['ana',['pais','genero']]

pais      co
genero     M
Name: ana, dtype: object

In [ ]:
df.loc['daniel','Q1']

nan

Se pueden localizar datos por su posición

In [ ]:
df.iloc[3,2]

'mx'

In [ ]:
df.iloc[3,[2,3]]

pais      mx
genero     M
Name: daniel, dtype: object

In [ ]:
df.iloc[[3,4,5],[2,3]]

       pais genero
daniel   mx      M
erika    mx      M
fabian   ch      M

Con dos puntos (:) se selecciona la columna entera

In [ ]:
df.iloc[:,[2,3]]

         pais genero
ana        co      M
benito     mx      F
camilo     co      F
daniel     mx      M
erika      mx      M
fabian     ch      M
gabriela   ch      F

También se pueden aplicar constricciones a los valores

In [ ]:
df['edad'] >= 12

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [ ]:
df[df['edad'] >= 12]

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9

In [ ]:
df[(df['cm'] >= 130) & (df['pais'] == 'mx')]

        edad   cm pais genero  Q1  Q2
daniel    14  155   mx      M NaN   8

Lo anterior también se puede usar con la función "query", y es mucho más sencillo

In [ ]:
df.query('edad > 12')

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8

Se pueden comparar dos columnas

In [ ]:
df['Q2'] > df['Q1']

ana          True
benito      False
camilo       True
daniel      False
erika        True
fabian      False
gabriela     True
dtype: bool

In [ ]:
df[df['Q2'] > df['Q1']]

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9